{
  "Header.Item1": "About Me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "kalab_reda_resume.pdf",

  "Banner.Pretitle": "Hello! My name is",
  "Banner.Description": "I have <span class='underline'>6 years of experience</span> developing scalable systems, reusable components, and technological solutions to make the web a better place. I am dedicated to writing and refactoring clean, reusable, and scalable code in <span class='underline'>Angular</span> and <span class='underline'>Java</span>, applying good practices and development standards.",
  "Banner.ActionBtn": "Say Hi",

  "AboutMe.Title": "About Me",
  "AboutMe.Paragraphs": [
    "In <span class='underline'>6 years of experience</span> I have covered many roles: <span class='underline'>Software Engineer</span>, <span class='underline'>Backend Developer</span>, <span class='underline'>Senior Software Engineer</span>, and <span class='underline'>Full Stack Java Developer</span>. I love contributing my knowledge to create new things that help solve problems.",
    "My capabilities also include implementing system improvements, optimizing solutions, standardizing patterns, and suggesting and executing ideas that add value to the project I am working on.",
    "I also program things for my personal use, whether for hobby or utility.",
    "Some of the technologies I have trained and worked with include (but are not limited to):"
  ],

  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "HireArt",
      "Title": "Fullstack Java Developer",
      "Date": "December 2023",
      "Description": [
        "Developed new features and maintained a highly scalable and robust platform built with Java 11, Spring Boot, Angular 15, and AWS, serving a total of 1.9 million users per week.",
        "Diagnosed and resolved technical issues, including performance bottlenecks and bugs, by employing thorough debugging and problem-solving strategies, resulting in a 7% improvement in application performance and a 2% reduction in bug-related incidents.",
        "Developed complex functionalities with Java 11 and Spring Boot to support high-demand communication services. ",
        "Applied design patterns to address complex challenges, developing solutions that facilitated easier future modifications and enhancements."
      ]
    },
    {
      "Tab": "PIS II",
      "Title": "Senior Software Engineer",
      "Date": "August 2021 - October 2022",
      "Description": [
        "Led the development of multiple enterprise-level modules for the FDRE Public Procurement and Property Authority, automating the procurement of goods worth $2.7 billion to date, using Java 8, Spring Boot and, AWS.",
        "Spearheaded the development and creation of the startup code for microservices, which served as the foundation for the entire project and was utilized by 5 developers in a team.",
        "Managed database operations using PostgreSQL, optimizing queries and ensuring high performance and reliability.",
        "Mentored 8 junior engineers on coding standards, best practices, and methodologies.",
        "Managed and organized project tasks and issues using GitLab, facilitating efficient collaboration within the team."
      ]
    },
    {
      "Tab": "PIS I",
      "Title": "Software Engineer",
      "Date": "July 2017 - August 2019",
      "Description": [
        "Pioneered the transformation of a costly native app into an Angular SPA, enhancing performance, user experience, and accessibility while reducing development and maintenance costs by 16%.",
        "Implemented microservices architecture with Spring Boot services, interacting through REST and Apache Kafka endpoints, deployed on AWS using Docker containers and Kubernetes.",
        "Built dynamic front-end applications with Angular v9+, applying MV* architectural patterns, automated testing and deployment pipelines using Karma, and Selenium, which reduced testing time by 30% and increased software reliability.",
        "Developed and optimized web applications using Node.js with Express, implementing asynchronous code to enhance performance.",
        "Utilized JS tooling like ESLint, and Webpack to streamline the build process and improve code quality.",
        "Worked extensively with Hibernate for database interactions, simplifying data access and reducing the need for complex SQL queries in our projects.",
        "Built 12 in-house UI libraries to create reusable components and minimize development time by 24%, and contributing to a robust and scalable code base using Angular.",
        "Implemented Kafka producers and consumers to facilitate real-time, event-driven communication between microservices in a Java back-end deployed in the AWS cloud.",
        "Analyzed business requirements, and designed solutions for ECM migrations on AWS while working effectively with various stakeholders in an Agile/Scrum environment.",
        "Built RESTful APIs in Spring Boot to build efficient and scalable microservices, enabling seamless communication between different components of the application.",
        "Utilized Apache Kafka for managing large volumes of messages and implemented RESTful services to push messages to Cassandra, ensuring high-performance data processing.",
        "Developed over 500-unit tests to verify the functionality of back-end processing, connectivity and relational database interactions.",
        "Collaborated with cross-functional teams, utilizing Java, Spring Boot, Angular, and PostgreSQL to successfully implement 8 projects.",
        "Developed an authorization server in Spring Boot OAuth2 and implemented secure stateless authentication using JSON web tokens (JWT) to ensure service security."
      ]

    }
  ],

  "FeatureProjects.Title": "My Projects",
  "FeatureProjects.Label": "Highlighted Project",
  "FeatureProjects.Projects": [
    {
      "Title": "eGP",
      "Description": "Electronic Government Procurement (eGP) refers to the use of digital technologies to enable a more efficient and transparent exchange of information, and interactions and transactions between government and the business community in the procurement of goods, services and works. E-GP automates and streamlines the end-to-end public procurement process from the preparation and publication of annual procurement plans, managing the various tendering activities, and administration of contracts.",
      "imgs": [
        "assets/images/egp/egp.png",
        "assets/images/egp/egp1.png",
        "assets/images/egp/egp2.png",
        "assets/images/egp/egp3.png",
        "assets/images/egp/egp4.png"
      ],
      "Technologies": ["Java", "Angular", "Spring Boot", "Ant Design", "NgRX"]
    },
    {
      "Title": "RemoTasks",
      "Description": "A platform used to train LLMs using remote workers from all over the world and that data is used to reinforce and train the LLMs.",
      "imgs": [
        "assets/images/remo/remo.png",
        "assets/images/remo/remo1.png"
      ],
      "Technologies": ["Java", "Angular", "Spring Boot", "Angular Material", "RxJS"]
    }
  ],

  "Contact.Pretitle": "And... Now?",
  "Contact.Title": "Say Hi!",
  "Contact.Content": "I will be glad to hear from you if you want to discuss new opportunities. Write to me, and I will respond as soon as I see your message.",
  "Contact.Btn": "Contact Me"
}
